tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1783_tdd.h
#define ACKTIM                        522
#define ODCONA0                       523
#define ODCONA                        524
#define ODCONA1                       525
#define ODCONA2                       526
#define ODCONA3                       527
#define ODCONA4                       528
#define ODCONA5                       529
#define ODCONA6                       530
#define ODCONA7                       531
#define ODCONB0                       532
#define ODCONB                        533
#define ODCONB1                       534
#define ODCONB2                       535
#define ODCONB3                       536
#define ODCONB4                       537
#define ODCONB5                       538
#define ODCONB6                       539
#define ODCONB7                       540
#define ODCONC0                       541
#define ODCONC                        542
#define ODCONC1                       543
#define ODCONC2                       544
#define ODCONC3                       545
#define ODCONC4                       546
#define ODCONC5                       547
#define ODCONC6                       548
#define ODCONC7                       549
#define CCPR1L                        550
#define CCPR1H                        551
#define CCP1CON                       552
#define CCP1M0                        553
#define CCP1M                         554
#define CCP1M1                        555
#define CCP1M2                        556
#define CCP1M3                        557
#define DC1B                          558
#define DC1B0                         559
#define DC1B1                         560
#define P1M                           561
#define P1M0                          562
#define P1M1                          563
#define CCPR2L                        564
#define CCPR2H                        565
#define CCP2CON                       566
#define CCP2M                         567
#define CCP2M0                        568
#define CCP2M1                        569
#define CCP2M2                        570
#define CCP2M3                        571
#define DC2B                          572
#define DC2B0                         573
#define DC2B1                         574
#define P2M                           575
#define P2M0                          576
#define P2M1                          577
#define SLRCONA0                      578
#define SLRCONA                       579
#define SLRCONA1                      580
#define SLRCONA2                      581
#define SLRCONA3                      582
#define SLRCONA4                      583
#define SLRCONA5                      584
#define SLRCONA6                      585
#define SLRCONA7                      586
#define SLRCONB                       587
#define SLRCONB0                      588
#define SLRCONB1                      589
#define SLRCONB2                      590
#define SLRCONB3                      591
#define SLRCONB4                      592
#define SLRCONB5                      593
#define SLRCONB6                      594
#define SLRCONB7                      595
#define SLRCONC                       596
#define SLRCONC0                      597
#define SLRCONC1                      598
#define SLRCONC2                      599
#define SLRCONC3                      600
#define SLRCONC4                      601
#define SLRCONC5                      602
#define SLRCONC6                      603
#define SLRCONC7                      604
#define INLVLA                        605
#define INLVLA0                       606
#define INLVLA1                       607
#define INLVLA2                       608
#define INLVLA3                       609
#define INLVLA4                       610
#define INLVLA5                       611
#define INLVLA6                       612
#define INLVLA7                       613
#define INLVLB                        614
#define INLVLB0                       615
#define INLVLB1                       616
#define INLVLB2                       617
#define INLVLB3                       618
#define INLVLB4                       619
#define INLVLB5                       620
#define INLVLB6                       621
#define INLVLB7                       622
#define INLVLC                        623
#define INLVLC0                       624
#define INLVLC1                       625
#define INLVLC2                       626
#define INLVLC3                       627
#define INLVLC4                       628
#define INLVLC5                       629
#define INLVLC6                       630
#define INLVLC7                       631
#define INLVLE                        632
#define INLVLE3                       633
#define IOCAP                         634
#define IOCAP0                        635
#define IOCAP1                        636
#define IOCAP2                        637
#define IOCAP3                        638
#define IOCAP4                        639
#define IOCAP5                        640
#define IOCAP6                        641
#define IOCAP7                        642
#define IOCAN                         643
#define IOCAN0                        644
#define IOCAN1                        645
#define IOCAN2                        646
#define IOCAN3                        647
#define IOCAN4                        648
#define IOCAN5                        649
#define IOCAN6                        650
#define IOCAN7                        651
#define IOCAF0                        652
#define IOCAF                         653
#define IOCAF1                        654
#define IOCAF2                        655
#define IOCAF3                        656
#define IOCAF4                        657
#define IOCAF5                        658
#define IOCAF6                        659
#define IOCAF7                        660
#define IOCBP                         661
#define IOCBP0                        662
#define IOCBP1                        663
#define IOCBP2                        664
#define IOCBP3                        665
#define IOCBP4                        666
#define IOCBP5                        667
#define IOCBP6                        668
#define IOCBP7                        669
#define IOCBN0                        670
#define IOCBN                         671
#define IOCBN1                        672
#define IOCBN2                        673
#define IOCBN3                        674
#define IOCBN4                        675
#define IOCBN5                        676
#define IOCBN6                        677
#define IOCBN7                        678
#define IOCBF0                        679
#define IOCBF                         680
#define IOCBF1                        681
#define IOCBF2                        682
#define IOCBF3                        683
#define IOCBF4                        684
#define IOCBF5                        685
#define IOCBF6                        686
#define IOCBF7                        687
#define IOCCP0                        688
#define IOCCP                         689
#define IOCCP1                        690
#define IOCCP2                        691
#define IOCCP3                        692
#define IOCCP4                        693
#define IOCCP5                        694
#define IOCCP6                        695
#define IOCCP7                        696
#define IOCCN0                        697
#define IOCCN                         698
#define IOCCN1                        699
#define IOCCN2                        700
#define IOCCN3                        701
#define IOCCN4                        702
#define IOCCN5                        703
#define IOCCN6                        704
#define IOCCN7                        705
#define IOCCF0                        706
#define IOCCF                         707
#define IOCCF1                        708
#define IOCCF2                        709
#define IOCCF3                        710
#define IOCCF4                        711
#define IOCCF5                        712
#define IOCCF6                        713
#define IOCCF7                        714
#define IOCEP                         715
#define IOCEP3                        716
#define IOCEN                         717
#define IOCEN3                        718
#define IOCEF                         719
#define IOCEF3                        720
#define OPA1CON                       721
#define OPA1CH0                       722
#define OPA1CH                        723
#define OPA1CH1                       724
#define OPA1SP                        725
#define OPA1EN                        726
#define OPA2CON                       727
#define OPA2CH                        728
#define OPA2CH0                       729
#define OPA2CH1                       730
#define OPA2SP                        731
#define OPA2EN                        732
#define CLKRCON                       733
#define CLKRDIV                       734
#define CLKRDIV0                      735
#define CLKRDIV1                      736
#define CLKRDIV2                      737
#define CLKRDC                        738
#define CLKRDC0                       739
#define CLKRDC1                       740
#define CLKRSLR                       741
#define CLKROE                        742
#define CLKREN                        743
#define PSMC1CON                      744
#define P1MODE                        745
#define P1MODE0                       746
#define P1MODE1                       747
#define P1MODE2                       748
#define P1MODE3                       749
#define P1DBRE                        750
#define P1DBFE                        751
#define PSMC1LD                       752
#define PSMC1EN                       753
#define PSMC1MDL                      754
#define P1MSRC0                       755
#define P1MSRC                        756
#define P1MSRC1                       757
#define P1MSRC2                       758
#define P1MSRC3                       759
#define P1MDLBIT                      760
#define P1MDLPOL                      761
#define P1MDLEN                       762
#define PSMC1SYNC                     763
#define P1SYNC0                       764
#define P1SYNC1                       765
#define PSMC1CLK                      766
#define P1CSRC                        767
#define P1CSRC0                       768
#define P1CSRC1                       769
#define P1CPRE                        770
#define P1CPRE0                       771
#define P1CPRE1                       772
#define PSMC1OEN                      773
#define P1OEA                         774
#define P1OEB                         775
#define P1OEC                         776
#define P1OED                         777
#define P1OEE                         778
#define P1OEF                         779
#define PSMC1POL                      780
#define P1POLA                        781
#define P1POLB                        782
#define P1POLC                        783
#define P1POLD                        784
#define P1POLE                        785
#define P1POLF                        786
#define P1INPOL                       787
#define PSMC1BLNK                     788
#define P1REBM                        789
#define P1REBM0                       790
#define P1REBM1                       791
#define P1FEBM0                       792
#define P1FEBM                        793
#define P1FEBM1                       794
#define PSMC1REBS                     795
#define P1REBSC1                      796
#define P1REBSC2                      797
#define P1REBSC3                      798
#define P1REBSIN                      799
#define PSMC1FEBS                     800
#define P1FEBSC1                      801
#define P1FEBSC2                      802
#define P1FEBSC3                      803
#define P1FEBSIN                      804
#define PSMC1PHS                      805
#define P1PHST                        806
#define P1PHSC1                       807
#define P1PHSC2                       808
#define P1PHSC3                       809
#define P1PHSIN                       810
#define PSMC1DCS                      811
#define P1DCST                        812
#define P1DCSC1                       813
#define P1DCSC2                       814
#define P1DCSC3                       815
#define P1DCSIN                       816
#define PSMC1PRS                      817
#define P1PRST                        818
#define P1PRSC1                       819
#define P1PRSC2                       820
#define P1PRSC3                       821
#define P1PRSIN                       822
#define PSMC1ASDC                     823
#define P1ASDOV                       824
#define P1ARSEN                       825
#define P1ASDEN                       826
#define P1ASE                         827
#define PSMC1ASDL                     828
#define P1ASDLA                       829
#define P1ASDLB                       830
#define P1ASDLC                       831
#define P1ASDLD                       832
#define P1ASDLE                       833
#define P1ASDLF                       834
#define PSMC1ASDS                     835
#define P1ASDSC1                      836
#define P1ASDSC2                      837
#define P1ASDSC3                      838
#define P1ASDSIN                      839
#define PSMC1INT                      840
#define P1TPRIF                       841
#define P1TDCIF                       842
#define P1TPHIF                       843
#define P1TOVIF                       844
#define P1TPRIE                       845
#define P1TDCIE                       846
#define P1TPHIE                       847
#define P1TOVIE                       848
#define PSMC1PHL                      849
#define PSMC1PH0                      850
#define PSMC1PH1                      851
#define PSMC1PH2                      852
#define PSMC1PH3                      853
#define PSMC1PH4                      854
#define PSMC1PH5                      855
#define PSMC1PH6                      856
#define PSMC1PH7                      857
#define PSMC1PHH                      858
#define PSMC1PH8                      859
#define PSMC1PH9                      860
#define PSMC1PH10                     861
#define PSMC1PH11                     862
#define PSMC1PH12                     863
#define PSMC1PH13                     864
#define PSMC1PH14                     865
#define PSMC1PH15                     866
#define PSMC1DCL                      867
#define PSMC1DC0                      868
#define PSMC1DC1                      869
#define PSMC1DC2                      870
#define PSMC1DC3                      871
#define PSMC1DC4                      872
#define PSMC1DC5                      873
#define PSMC1DC6                      874
#define PSMC1DC7                      875
#define PSMC1DCH                      876
#define PSMC1DC8                      877
#define PSMC1DC9                      878
#define PSMC1DC10                     879
#define PSMC1DC11                     880
#define PSMC1DC12                     881
#define PSMC1DC13                     882
#define PSMC1DC14                     883
#define PSMC1DC15                     884
#define PSMC1PRL                      885
#define PSMC1PR0                      886
#define PSMC1PR1                      887
#define PSMC1PR2                      888
#define PSMC1PR3                      889
#define PSMC1PR4                      890
#define PSMC1PR5                      891
#define PSMC1PR6                      892
#define PSMC1PR7                      893
#define PSMC1PRH                      894
#define PSMC1PR8                      895
#define PSMC1PR9                      896
#define PSMC1PR10                     897
#define PSMC1PR11                     898
#define PSMC1PR12                     899
#define PSMC1PR13                     900
#define PSMC1PR14                     901
#define PSMC1PR15                     902
#define PSMC1TMRL                     903
#define PSMC1TMR0                     904
#define PSMC1TMR1                     905
#define PSMC1TMR2                     906
#define PSMC1TMR3                     907
#define PSMC1TMR4                     908
#define PSMC1TMR5                     909
#define PSMC1TMR6                     910
#define PSMC1TMR7                     911
#define PSMC1TMRH                     912
#define PSMC1TMR8                     913
#define PSMC1TMR9                     914
#define PSMC1TMR10                    915
#define PSMC1TMR11                    916
#define PSMC1TMR12                    917
#define PSMC1TMR13                    918
#define PSMC1TMR14                    919
#define PSMC1TMR15                    920
#define PSMC1DBR                      921
#define PSMC1DBR0                     922
#define PSMC1DBR1                     923
#define PSMC1DBR2                     924
#define PSMC1DBR3                     925
#define PSMC1DBR4                     926
#define PSMC1DBR5                     927
#define PSMC1DBR6                     928
#define PSMC1DBR7                     929
#define PSMC1DBF                      930
#define PSMC1DBF0                     931
#define PSMC1DBF1                     932
#define PSMC1DBF2                     933
#define PSMC1DBF3                     934
#define PSMC1DBF4                     935
#define PSMC1DBF5                     936
#define PSMC1DBF6                     937
#define PSMC1DBF7                     938
#define PSMC1BLKR                     939
#define PSMC1BLKR0                    940
#define PSMC1BLKR1                    941
#define PSMC1BLKR2                    942
#define PSMC1BLKR3                    943
#define PSMC1BLKR4                    944
#define PSMC1BLKR5                    945
#define PSMC1BLKR6                    946
#define PSMC1BLKR7                    947
#define PSMC1BLKF                     948
#define PSMC1BLKF0                    949
#define PSMC1BLKF1                    950
#define PSMC1BLKF2                    951
#define PSMC1BLKF3                    952
#define PSMC1BLKF4                    953
#define PSMC1BLKF5                    954
#define PSMC1BLKF6                    955
#define PSMC1BLKF7                    956
#define PSMC1FFA                      957
#define PSMC1FFA0                     958
#define PSMC1FFA1                     959
#define PSMC1FFA2                     960
#define PSMC1FFA3                     961
#define PSMC1STR0                     962
#define P1STRA                        963
#define P1STRB                        964
#define P1STRC                        965
#define P1STRD                        966
#define P1STRE                        967
#define P1STRF                        968
#define PSMC1STR1                     969
#define P1HSMEN                       970
#define P1LSMEN                       971
#define P1SSYNC                       972
#define PSMC2CON                      973
#define P2MODE                        974
#define P2MODE0                       975
#define P2MODE1                       976
#define P2MODE2                       977
#define P2MODE3                       978
#define P2DBRE                        979
#define P2DBFE                        980
#define PSMC2LD                       981
#define PSMC2EN                       982
#define PSMC2MDL                      983
#define P2MSRC                        984
#define P2MSRC0                       985
#define P2MSRC1                       986
#define P2MSRC2                       987
#define P2MSRC3                       988
#define P2MDLBIT                      989
#define P2MDLPOL                      990
#define P2MDLEN                       991
#define PSMC2SYNC                     992
#define P2SYNC0                       993
#define P2SYNC1                       994
#define PSMC2CLK                      995
#define P2CSRC0                       996
#define P2CSRC                        997
#define P2CSRC1                       998
#define P2CPRE                        999
#define P2CPRE0                       1000
#define P2CPRE1                       1001
#define PSMC2OEN                      1002
#define P2OEA                         1003
#define P2OEB                         1004
#define PSMC2POL                      1005
#define P2POLA                        1006
#define P2POLB                        1007
#define P2INPOL                       1008
#define PSMC2BLNK                     1009
#define P2REBM                        1010
#define P2REBM0                       1011
#define P2REBM1                       1012
#define P2FEBM0                       1013
#define P2FEBM                        1014
#define P2FEBM1                       1015
#define PSMC2REBS                     1016
#define P2REBSC1                      1017
#define P2REBSC2                      1018
#define P2REBSC3                      1019
#define P2REBSIN                      1020
#define PSMC2FEBS                     1021
#define P2FEBSC1                      1022
#define P2FEBSC2                      1023
#define P2FEBSC3                      1024
#define P2FEBSIN                      1025
#define PSMC2PHS                      1026
#define P2PHST                        1027
#define P2PHSC1                       1028
#define P2PHSC2                       1029
#define P2PHSC3                       1030
#define P2PHSIN                       1031
#define PSMC2DCS                      1032
#define P2DCST                        1033
#define P2DCSC1                       1034
#define P2DCSC2                       1035
#define P2DCSC3                       1036
#define P2DCSIN                       1037
#define PSMC2PRS                      1038
#define P2PRST                        1039
#define P2PRSC1                       1040
#define P2PRSC2                       1041
#define P2PRSC3                       1042
#define P2PRSIN                       1043
#define PSMC2ASDC                     1044
#define P2ASDOV                       1045
#define P2ARSEN                       1046
#define P2ASDEN                       1047
#define P2ASE                         1048
#define PSMC2ASDL                     1049
#define P2ASDLA                       1050
#define P2ASDLB                       1051
#define PSMC2ASDS                     1052
#define P2ASDSC1                      1053
#define P2ASDSC2                      1054
#define P2ASDSC3                      1055
#define P2ASDSIN                      1056
#define PSMC2INT                      1057
#define P2TPRIF                       1058
#define P2TDCIF                       1059
#define P2TPHIF                       1060
#define P2TOVIF                       1061
#define P2TPRIE                       1062
#define P2TDCIE                       1063
#define P2TPHIE                       1064
#define P2TOVIE                       1065
#define PSMC2PHL                      1066
#define PSMC2PH0                      1067
#define PSMC2PH1                      1068
#define PSMC2PH2                      1069
#define PSMC2PH3                      1070
#define PSMC2PH4                      1071
#define PSMC2PH5                      1072
#define PSMC2PH6                      1073
#define PSMC2PH7                      1074
#define PSMC2PHH                      1075
#define PSMC2PH8                      1076
#define PSMC2PH9                      1077
#define PSMC2PH10                     1078
#define PSMC2PH11                     1079
#define PSMC2PH12                     1080
#define PSMC2PH13                     1081
#define PSMC2PH14                     1082
#define PSMC2PH15                     1083
#define PSMC2DCL                      1084
#define PSMC2DC0                      1085
#define PSMC2DC1                      1086
#define PSMC2DC2                      1087
#define PSMC2DC3                      1088
#define PSMC2DC4                      1089
#define PSMC2DC5                      1090
